Autodesk.Revit.DB.Structure.TargetRebarConstraintType
A type used to identify the particular part of a rebar target to which a rebar's handle is constrained.
Remarks:
Most of the range of values for this type are the same as those of RebarHandleType,
since it is usually the handles on the Stirrup which constrain the Standard bar.
However, two additional values - BarBend and HookBend - are used to identify the
special case of a Shape Driven, Standard style, straight bar, running perpendicular to the plane
of the Stirrup, and constrained to a bend (or hook) arc on the Stirrup.
Since:
2014
Since:
2014

Autodesk.Revit.DB.Structure.TargetRebarConstraintType.OutOfPlaneExtent
Handle is constrained to the extent of a three-dimensional Shape Driven Rebar out of
its primary plane. This includes the length of a Rebar Set, the
out-of-plane length of a multi-planar Rebar, and the length of a
spiral Rebar.

Autodesk.Revit.DB.Structure.TargetRebarConstraintType.Edge
Handle is constrained to location of a single edge segment of the other Rebar.

Autodesk.Revit.DB.Structure.TargetRebarConstraintType.RebarPlane
Handle is constrained to the location of the other Rebar's primary plane.
Drives location of the entire Shape Driven Rebar along the direction of its normal.